//--------------------------------------------------
// Интерфейс к модулю HC-05
//--------------------------------------------------
#ifndef HC_05_H
#define HC_05_H

//--------------------------------------------------
#define HC_BUFF_SIZE 100

//--------------------------------------------------
extern volatile char hc05_buff[HC_BUFF_SIZE];

//--------------------------------------------------
extern void hc05_init(void);
extern void hc05_send(char *);
extern void hc05_recv(void);
extern uint8_t hc05_rcv_complete(void);

#endif
//--------------------------------------------------
