//--------------------------------------------------
// Модуль опроса клавиатуры
//--------------------------------------------------
#ifndef KEYBOARD_H
#define KEYBOARD_H

//--------------------------------------------------
enum _keys {
    A_UP=0,
    A_DN,
    B_UP,
    B_DN,
    SHIFT,
    RESET,

    KEY_COUNT
};

//--------------------------------------------------
extern void keyboard_init(void);
extern uint8_t get_keys(void);

#endif
//--------------------------------------------------
